app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.password = user_params[:password]
        @user.save!
---
INSERT INTO "users" ("created_at", "updated_at", "email", "session_token", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"